espressif/esp32-camera/sensors/nt99141.c
    // H-Mirror
    if (sensor->status.hmirror) {
        reg21 |= 0x02;
        reg4514_test |= 2;
    }

    switch (reg4514_test) {

    }

    if (write_reg(sensor->slv_addr, TIMING_TC_REG20, reg20 | reg21)) {
        ESP_LOGE(TAG, "Setting Image Options Failed");
        ret = -1;
    }

    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
             sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;

    sensor->status.framesize = framesize;
    ret = write_regs(sensor->slv_addr, sensor_default_regs);

    if (framesize == FRAMESIZE_QVGA) {
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA);
#if    CONFIG_NT99141_SUPPORT_XSKIP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: xskip mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA_xskip);
#elif  CONFIG_NT99141_SUPPORT_CROP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: crop mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA_crop);
#endif
    } else if (framesize == FRAMESIZE_VGA) {
        ESP_LOGD(TAG, "Set FRAMESIZE_VGA");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA);
#ifdef CONFIG_NT99141_SUPPORT_XSKIP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: xskip mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA_xskip);
#elif CONFIG_NT99141_SUPPORT_CROP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: crop mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA_crop);
#endif
    } else if (framesize >= FRAMESIZE_HD) {
        ESP_LOGD(TAG, "Set FRAMESIZE_HD");
        ret = write_regs(sensor->slv_addr, sensor_framesize_HD);
    } else {
        ESP_LOGD(TAG, "Dont suppost this size, Set FRAMESIZE_VGA");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA);
    }

    return 0;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.hmirror = enable;
    ret = set_image_options(sensor);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }

    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.vflip = enable;
    ret = set_image_options(sensor);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }

    return ret;
}

static int set_quality(sensor_t *sensor, int qs)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);

    if (ret == 0) {
        sensor->status.quality = qs;
        ESP_LOGD(TAG, "Set quality to: %d", qs);
    }

    return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);

    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }

    return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x32bb, 0x87, enable);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
        sensor->status.agc = enable;
    }

    return ret;
}

static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x32bb, 0x87, enable);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set exposure_ctrl to: %d", enable);
        sensor->status.aec = enable;
    }

    return ret;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set awb to: %d", enable);
        sensor->status.awb = enable;
    }

    return ret;
}

//Advanced AWB
static int set_dcw_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set dcw to: %d", enable);
        sensor->status.dcw = enable;
    }

    return ret;
}

//night mode enable
static int set_aec2(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set aec2 to: %d", enable);
        sensor->status.aec2 = enable;
    }

    return ret;
}

static int set_bpc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set bpc to: %d", enable);
        sensor->status.bpc = enable;
    }

    return ret;
}

static int set_wpc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set wpc to: %d", enable);
        sensor->status.wpc = enable;
    }

    return ret;
}

//Gamma enable
static int set_raw_gma_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set raw_gma to: %d", enable);
        sensor->status.raw_gma = enable;
    }

    return ret;
}

static int set_lenc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set lenc to: %d", enable);
        sensor->status.lenc = enable;
    }

    return ret;
}

static int get_agc_gain(sensor_t *sensor)
{
    ESP_LOGD(TAG, "get_agc_gain can not be configured at present");
    return 0;
}

//real gain
static int set_agc_gain(sensor_t *sensor, int gain)
{
    ESP_LOGD(TAG, "set_agc_gain can not be configured at present");
    return 0;
}

static int get_aec_value(sensor_t *sensor)
{
    ESP_LOGD(TAG, "get_aec_value can not be configured at present");
    return 0;
}

static int set_aec_value(sensor_t *sensor, int value)
{
    ESP_LOGD(TAG, "set_aec_value can not be configured at present");
    return 0;
}

static int set_ae_level(sensor_t *sensor, int level)
{
    ESP_LOGD(TAG, "set_ae_level can not be configured at present");
    return 0;
}

static int set_wb_mode(sensor_t *sensor, int mode)
{
    int ret = 0;

    if (mode < 0 || mode > 4) {
        return -1;
    }

    ret = write_reg(sensor->slv_addr, 0x3201, (mode != 0));

    if (ret) {
        return ret;
    }

